In [1]:
import pickle

In [7]:
with open ('./data/pickles/40k_sample.p', "rb") as readfile: 
    X, y = pickle.load(readfile)

In [8]:
X

                                                      text
7935619  Chips and salsa were awesome! Taco bowl was am...
6261538  When you take acrylic nails off, your suppose ...
1261782  One of the best places for Turkish food in the...
7802386  So difficult to book appointments with. They r...
6792587  Scheduled a "do what you gotta do" massage wit...
...                                                    ...
3645263  Very good car wash by hand then wax by hand pr...
4730304  Expensive for what you get. I got a Mediterran...
1911662  What a fantastic place! I have stayed in the M...
7480720  Foods are ok, the services suck, the waitress ...
6713090  I had salami & eggs and B had buckwheat pancak...

[40106 rows x 1 columns]

In [10]:
y

7935619    4
6261538    1
1261782    5
7802386    2
6792587    5
          ..
3645263    4
4730304    1
1911662    5
7480720    1
6713090    5
Name: stars, Length: 40106, dtype: int64

In [11]:
df = X.copy()

In [12]:
df['stars'] = y

In [13]:
df.head()

                                                      text  stars
7935619  Chips and salsa were awesome! Taco bowl was am...      4
6261538  When you take acrylic nails off, your suppose ...      1
1261782  One of the best places for Turkish food in the...      5
7802386  So difficult to book appointments with. They r...      2
6792587  Scheduled a "do what you gotta do" massage wit...      5

In [14]:
df = df[df['stars'] != 3]

In [17]:
def num_to_cat(star):
    if star == 4 or star == 5:
        return 'pos'
    else:
        return 'neg'

In [18]:
df.stars.apply(num_to_cat)

7935619    pos
6261538    neg
1261782    pos
7802386    neg
6792587    pos
          ...
3645263    pos
4730304    neg
1911662    pos
7480720    neg
6713090    pos
Name: stars, Length: 35894, dtype: object